<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest nightly build of WebKit.</string>
    <key>Identifier</key>
    <string>com.github.nbalonso.download.WebKit</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>WebKit</string>
        <key>SPARKLE_FEED_URL</key>
        <string>https://nightly.webkit.org/builds/trunk/mac/rss</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>The nbalonso-recipes repository is being deprecated and archived (https://github.com/autopkg/nbalonso-recipes/issues/2). You can find the latest WebKit downloads at https://webkit.org/downloads/ and you can find recipes for the Safari Technology Preview in the jaharmi-recipes repo.</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>SparkleUpdateInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>appcast_url</key>
                <string>%SPARKLE_FEED_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
